//======================================================================================================================
// Сессия и информация о пользователе
//======================================================================================================================

/**
 * Ответ с данными успешно инициализированной сессии.
 */
export interface SessionInfo {
  /** Идентификатор сессии. */
  sessionId: string;
  /** Имя отладочного канала. */
  debugPipeName: string;
}

/**
 * Базовая информация о пользователе.
 */
export interface UserInfo {
  /** Полное имя (ФИО). */
  name: string;
  /** Короткое имя в системе. */
  shortName: string;
  /** Строка параметров, разделённых `|`. */
  properties: string;
}

//======================================================================================================================
// Информация о системе
//======================================================================================================================

/**
 * Информация о ядре системы.
 */
export interface CoreInfo {
  /** Код аудитора (например, "AUD"). */
  auditor: string;
  /** Владелец (например, "IBS"). */
  owner: string;
  /** Версия ТЯ (например, "7.6"). */
  version: string;
  /** Номер сборки. */
  build: string;
  /** Ревизия. */
  revision: string;
  /** Версия сервера приложений. */
  asVersion: string;
  /** Дата сборки сервера приложений. */
  asWarDate: string;
}

/**
 * Cистемная настройка (ключ-значение).
 */
export interface Setting {
  /** Имя настройки. */
  name: string;
  /** Значение настройки (может отсутствовать). */
  value: string | undefined;
}

//======================================================================================================================
// ТБП и их экземпляры
//======================================================================================================================

/**
 * Идентификатор ТБП и ключ архива экземпляра.
 */
export interface ObjectClassAndArchiveKey {
  /** Короткое имя текущего ТБП экземпляра. */
  classId: string | undefined;
  /** Ключ архива. */
  archiveKey: string | undefined;
}

/**
 * Обратная ссылка на экземпляр.
 */
export interface BackwardReference {
  /** Короткое имя ТБП, который ссылается. */
  classId: string;
  /** Полное имя ТБП. */
  className: string;
  /** Квалификатор. */
  qual: string;
  /** Имя квалификатора. */
  qualName: string;
}

/**
 * Переход состояний ТБП.
 */
export interface Transition {
  /** Идентификатор перехода. */
  id: string;
  /** Название перехода. */
  name: string;
  /** Короткое имя операции (может отсутствовать). */
  methodShortName?: string;
  /** ID начального состояния. */
  initialStateID: string;
  /** ID конечного состояния. */
  finalStateID: string;
}

/**
 * Состояние ТБП.
 */
export interface State {
  /** Идентификатор состояния. */
  id: string;
  /** Название состояния. */
  name: string;
  /** Индекс использования. */
  indexUse: string;
}
